#
str1 = "梅西携队凯旋球迷接机欢庆"

# center(填充后的长度,填充的内容)  将字符串按照指定的内容填充到指定长度,默认填充的内容是空格
print(str1)
print(str1.center(50))
print(str1.center(50,'*'))   # *******************梅西携队凯旋球迷接机欢庆*******************

# ljust(填充后的长度,填充的内容)   向左填充,  原内容靠左,填充的内容靠右
print(str1.ljust(50,'%'))   # 梅西携队凯旋球迷接机欢庆%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

# rjust(填充后的长度,填充的内容)   向右填充,  原内容靠右,填充的内容靠左
print(str1.rjust(50,'+'))   # ++++++++++++++++++++++++++++++++++++++梅西携队凯旋球迷接机欢庆

# zfill(填充后的长度) 使用数字0 填充字符串到指定的长度
print(str1.zfill(50))   # 00000000000000000000000000000000000000梅西携队凯旋球迷接机欢庆