# 分为两类: 简单的赋值运算符   和  复合赋值运算符

# 简单的赋值运算符: =   表示把 = 右边的值赋给左边的变量
num = 123
# print(num)

# 复合赋值运算符: += -= *= /= **= %= //=   表示给一个变量赋值,同时对该变量进行了相应的运算.
num1 = 32
# num1 = num1 + 11   # 表示对num1进行加法运算,并且把运算后的结果又赋给了num1变量本身
# print(num1)  # 43

# += 运算
# num1 += 11  #等价于  num1 = num1 + 11
# print(num1)   # 43

# -=运算
# num1 -= 11 # 等价于  num1 = num1 - 11
# print(num1)   # 21

# *= 运算
# num1 *= 11   # 等价于  num1 = num1 * 11
# print(num1)   # 352

# /= 运算
# num1 /= 11    # 等价于  num1 = num1 / 11
# print(num1)   # 2.909090909090909

# %= 运算
# num1 %= 11     # 等价于 num1 = num1 % 11
# print(num1)   # 10

# //= 运算
num1 //= 11     # # 等价于 num1 = num1 // 11
print(num1)   # 2